{"data":[ { "_id" : { "$oid" : "5bde04e49bb1790f3045aab0"} , "Name" : "Desmond Cadogan" , "Title" : "Dancer" , "Bio" : "After arriving in NY from Canada at 17, Desmond studied with Dance Theater of Harlem then The Joffrey Ballet School. Later, he modeled for Robert Mapplethorpe, Rainer Fetting, Basquiat, Gaultier, Yves St Laurent, Miyake, Commes des Garcons, Mugler and others around the world before recently returning to dance with HLD."} , { "_id" : { "$oid" : "5bde04e49bb1790f3045aab2"} , "Name" : "Meredith Fages" , "Title" : "Dancer" , "Bio" : "has performed with Karole Armitage, Alexandra Beller, Monica Bill Barnes, David Hallberg/Francesco Vezzoli, Deborah Hay, Heidi Latsky, Elisabeth Motley, Palissimo, Jimena Paz, Laura Peterson, Sarah Skaggs, Steeledance, Virginia Ballet Theatre. Graduated from Columbia University, Pre-Medical Concentration in English. Mother of Graham Sterling Proskin. Joined HLD in 2007."} , { "_id" : { "$oid" : "5bde04e49bb1790f3045aab3"} , "Name" : "Victoria Dombroski" , "Title" : "Dancer" , "Bio" : "joined Heidi Latsky Dance in 2017. She received her dance training from the Greenwich Ballet Academy, the Royal Ballet School’s International Summer School, and the Merce Cunningham School. Victoria holds a B.A in French Studies from Columbia University and currently writes for Backstage Magazine and teaches French."} , { "_id" : { "$oid" : "5bde04e49bb1790f3045aab4"} , "Name" : "Chris Braz" , "Title" : "Dancer" , "Bio" : "is a Brooklyn based Afro-Latino Artist. He received his B.F.A in Dance from Wayne State University. He has been featured in Salon.com, The New York Times, as well as Film/TV appearances on Hulu, buzzfeed news, and Dixie-To-Go/ Project Runway commercials. For more info. visit www.chrisbraz.com"} , { "_id" : { "$oid" : "5bde04e49bb1790f3045aab5"} , "Name" : "Tiffany Geigel" , "Title" : "Dancer" , "Bio" : "started dancing at 3yrs old. She received her BA in NYC. Tiffany's TV appearances include SYTYCD, Don't Shoot the Messenger, \"Two In A Million; Tiniest Torso\", etc. Tiffany is working on an upcoming modeling book project titled \"The Beauty Of Tiffany\" by Asael Dror to be released mid 2018.  www.tiffanygeigel.com"} , { "_id" : { "$oid" : "5bde04e49bb1790f3045aab6"} , "Name" : "Nico Gonzales" , "Title" : "Dancer" , "Bio" : "a Colorado native, received his early training at Denver School of the Arts and with Brian Young.  He graduated from NYU Tisch where he performed in works by Bill T. Jones and Merce Cunningham. He currently dances for Rovaco Dance, Bryn Cohn + Artists and Gwendolyn & Guests."} , { "_id" : { "$oid" : "5bde04e49bb1790f3045aab7"} , "Name" : "Jerron Herman" , "Title" : "Dancer" , "Bio" : "is a principal dancer with cerebral palsy and Development Director at HLD, joining the company in 2011 having never danced before. Jerron is currently on the Board of Trustees at Dance/USA. He’s featured on Great Big Story, being called \"the inexhaustible Mr. Herman\" by The NY Times. "} , { "_id" : { "$oid" : "5bde04e49bb1790f3045aab8"} , "Name" : "Louisa Mann" , "Title" : "Dancer" , "Bio" : "began her training in Brattleboro, Vermont at the Brattleboro School of Dance. She has a BFA in dance from the University of Missouri-Kansas City and is currently working on her masters in Dance/Movement Therapy at the Pratt Institute. She began working with Heidi Latsky Dance in 2015. "} , { "_id" : { "$oid" : "5bde04e49bb1790f3045aab9"} , "Name" : "Jillian Hollis" , "Title" : "Dancer" , "Bio" : "originally from Syracuse, is a Point Park University graduate who joined HLD in 2002 and is now the company's Rehearsal Director. Her dancing has been described as “blithely irrepressible” by The NY Times. Jillian collaborates with other artists, is a burlesque performer and Miss Coney Island 2018."} , { "_id" : { "$oid" : "5bde04e49bb1790f3045aaba"} , "Name" : "Donald Lee" , "Title" : "Dancer" , "Bio" : "is a naturally kinetic bilateral amputee with no formal dance training prior to joining Heidi Latsky Dance in 2016.  He looks forward to continue to create challenging work without compromise with Heidi Latsky Dance. Donald lives in Brooklyn with his boyfriend Sean and their dogs Marshmallow and Loki."} , { "_id" : { "$oid" : "5bde04e49bb1790f3045aabb"} , "Name" : "Amy Meisner" , "Title" : "Dancer" , "Bio" : "native New Yorker, attended The High School of Performing Arts. Switched from Ballet to Modern Dance major. Dancer with Alvin Ailey's Workshop company, musical & regional theater. BA NYU/Tisch, Equity, SAG-AFTRA, MSW. Diagnosed with Multiple Sclerosis & Wheelchair user since 2004. Honored to be HLD member since 2016."} , { "_id" : { "$oid" : "5bde04e49bb1790f3045aabc"} , "Name" : "Kelly Ramis" , "Title" : "Dancer" , "Bio" : "began her training in Portland OR and graduated with a BA in Dance and minor in Business Management from Point Park University in 2014. Ramis has been dancing for HLD since August of 2016 and could not be happier to be a part of such an inspiring company! Other highlights include performing with Modus Operandi in Vancouver BC and being a member of Donofrio Dance Company, based in Brooklyn NY."} , { "_id" : { "$oid" : "5bde04e49bb1790f3045aabd"} , "Name" : "Jaclyn Rea" , "Title" : "Dancer" , "Bio" : "freelances with Heidi Latsky, Caterina Rago, Robert Mark Dance, and teaches at AMDA. She earned her B.F.A. from SUNY Purchase, and studied at London Contemporary Dance School on exchange. Rea’s danced in Graham 2, Ariel Rivka Dance, 10 Hairy Legs, among others, and has performed domestically and internationally."} , { "_id" : { "$oid" : "5bde04e49bb1790f3045aabe"} , "Name" : "Carmen Schoenster" , "Title" : "Dancer" , "Bio" : "attended the Governor’s School for the Arts. She was a trainee with Charlotte Ballet, Nashville Ballet also training with Richmond Ballet, Complexions and Parsons Dance.  Carmen was a company member of Todd Rosenlieb Dance and Virginia Ballet Theater before entering her 3rd season with Heidi Latsky Dance."} , { "_id" : { "$oid" : "5bde04e49bb1790f3045aabf"} , "Name" : "Tianshi Suo" , "Title" : "Dancer" , "Bio" : "born and raised in Beijing, China, came to NYC three years ago to pursue his dream in music. He graduated from Integral Yoga as a certified Hatha teacher. He tries to combine his unique musicality and his meditative approach to movement and life into dance performance."} , { "_id" : { "$oid" : "5bde04e49bb1790f3045aac0"} , "Name" : "Leslie Taub" , "Title" : "Dancer" , "Bio" : "is an intentional beauty, a disabled model and dancer, who has performed with Heidi Latsky since 2015. She is also a proud mama of two teenage humans and three rescue dogs."} , { "_id" : { "$oid" : "5bde04e49bb1790f3045aac1"} , "Name" : "Peter Trojic" , "Title" : "Dancer" , "Bio" : "is a disabled dancer with Cerebral Palsy from New York City who has been with Heidi Latsky Dance since the Summer of 2015 .  Peter also dances with Marked Dance Project. He went to Queens College for a B.A. in Urban Planning and Environmental Studies."} , { "_id" : { "$oid" : "5bde04e49bb1790f3045aac2"} , "Name" : "Sabatino Verlezza" , "Title" : "MFA Dancer" , "Bio" : "danced with the May O’Donnell Dance Company, Joyce Trisler Danscompany, Sophie Maslow, Norman Walker, Glenn-Lund Dance, Dances/Janet Soares, Claire Porter/Portables. His choreography has been presented nationally/internationally: Joyce Trisler Danscompany, Joffrey II, May O’Donnell Dance Company, Verlezza Dance, Dancing Wheels, Ben Vereen, and Christopher Walken among others."} ]}
